**`commonimages/base/windows_2012_r2`** terragrunt plan on `push` event [#421](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/base-windows-server-2012-r2"
        name         = "base_windows_server_2012_r2"
      ~ tags         = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "n/a"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "image-pipeline"                          = "base_windows_server_2012_r2"
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            "is-production"                           = "true"
            "os-version"                              = "windows server 2012 r2"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2"
        }
      ~ tags_all     = {
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-windows-server-2012-r2" -> (known after apply)
      ~ date_created                     = "2023-10-09T14:31:47.369Z" -> (known after apply)
      ~ date_last_run                    = "2023-10-09T14:45:10.945Z" -> (known after apply)
      ~ date_next_run                    = "2023-11-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-10-09T14:31:47.369Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-windows-server-2012-r2" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-windows-server-2012-r2/0.0.8" # forces replacement -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-windows-server-2012-r2-0-0-8" -> (known after apply)
        name                             = "base_windows_server_2012_r2"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "n/a"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "image-pipeline"                          = "base_windows_server_2012_r2"
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            "is-production"                           = "true"
            "os-version"                              = "windows server 2012 r2"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2"
        }
      ~ tags_all                         = {
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-windows-server-2012-r2/0.0.8" -> (known after apply)
      ~ date_created     = "2023-10-09T14:31:46.416Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-windows-server-2012-r2/0.0.8" -> (known after apply)
        name             = "base_windows_server_2012_r2"
      ~ owner            = "374269020027" -> (known after apply)
      ~ parent_image     = "ami-03ec0ba37fcffce0f" -> "ami-089fad2fece5002f1" # forces replacement
      ~ platform         = "Windows" -> (known after apply)
      ~ tags             = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "n/a"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "image-pipeline"                          = "base_windows_server_2012_r2"
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            "is-production"                           = "true"
            "os-version"                              = "windows server 2012 r2"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2"
        }
      ~ tags_all         = {
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            # (9 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.8" -> "0.1.0" # forces replacement
        # (1 unchanged attribute hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 128 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 128
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-windows-server-2012-r2-0-0-8" -> (known after apply)
      ~ date_created                  = "2023-10-09T14:31:46.207Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-windows-server-2012-r2-0-0-8" -> (known after apply)
      ~ name                          = "base_windows_server_2012_r2_0_0_8" -> "base_windows_server_2012_r2_0_1_0" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            # (9 unchanged elements hidden)
        }
      ~ security_group_ids            = [
          - "sg-0ffaf9373765d21e9",
            # (1 unchanged element hidden)
        ]
      ~ tags                          = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "n/a"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "image-pipeline"                          = "base_windows_server_2012_r2"
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            "is-production"                           = "true"
            "os-version"                              = "windows server 2012 r2"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/windows_server_2012_r2"
        }
      ~ tags_all                      = {
          ~ "image-recipe"                            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
          ~ "infrastructure-configuration"            = "base_windows_server_2012_r2/0.0.8" -> "base_windows_server_2012_r2/0.1.0"
            # (9 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
